logs/bench_concurrency_8_method_dflash_block_dy.log
INFO 07-29 14:26:54 [__init__.py:44] Available plugins for group vllm.platform_plugins:
INFO 07-29 14:26:54 [__init__.py:46] - ascend -> vllm_ascend:register
INFO 07-29 14:26:54 [__init__.py:49] All plugins in this group will be loaded. Set `VLLM_PLUGINS` to control which plugins to load.
INFO 07-29 14:26:54 [__init__.py:238] Platform plugin ascend is activated
2026-07-29 14:32:31,346 - 1690795 - ServiceProfiler - INFO - VLLM_USE_V1 not set, auto-detected via vLLM 0.20.2+empty: default 1
INFO 07-29 14:32:31 [nixl_utils.py:20] Setting UCX_RCACHE_MAX_UNRELEASED to '1024' to avoid a rare memory leak in UCX when using NIXL.
WARNING 07-29 14:32:31 [nixl_utils.py:34] NIXL is not available
WARNING 07-29 14:32:31 [nixl_utils.py:44] NIXL agent config is not available
WARNING 07-29 14:32:32 [registry.py:945] Model architecture DeepseekV4ForCausalLM is already registered, and will be overwritten by the new model class vllm_ascend.models.deepseek_v4:AscendDeepseekV4ForCausalLM.
WARNING 07-29 14:32:32 [registry.py:945] Model architecture DeepSeekV4MTPModel is already registered, and will be overwritten by the new model class vllm_ascend.models.deepseek_v4_mtp:DeepSeekV4MTP.
INFO 07-29 14:32:32 [__init__.py:110] Registered model loader `<class 'vllm_ascend.model_loader.netloader.netloader.ModelNetLoaderElastic'>` with load format `netloader`
INFO 07-29 14:32:32 [__init__.py:110] Registered model loader `<class 'vllm_ascend.model_loader.rfork.rfork_loader.RForkModelLoader'>` with load format `rfork`
Namespace(subparser='bench', bench_type='serve', dispatch_function=<function BenchmarkServingSubcommand.cmd at 0xfffebc3d44a0>, trust_remote_code=True, seed=0, num_prompts=400, dataset_name='custom', no_stream=False, dataset_path='/workspace/gsm8k_jsonl/test_vllm.jsonl', no_oversample=False, skip_chat_template=False, enable_multimodal_chat=False, disable_shuffle=False, custom_output_len=256, spec_bench_output_len=256, spec_bench_category=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, blazedit_min_distance=0.0, blazedit_max_distance=1.0, asr_max_audio_len_sec=inf, asr_min_audio_len_sec=0.0, random_input_len=1024, random_output_len=128, random_range_ratio='0.0', random_prefix_len=0, random_batch_size=1, no_reranker=False, random_mm_base_items_per_request=1, random_mm_num_mm_items_range_ratio=0.0, random_mm_limit_mm_per_prompt={'image': 255, 'video': 1}, random_mm_bucket_config={(256, 256, 1): 0.5, (720, 1280, 1): 0.5, (720, 1280, 16): 0.0}, hf_subset=None, hf_split=None, hf_name=None, hf_output_len=None, prefix_repetition_prefix_len=256, prefix_repetition_suffix_len=256, prefix_repetition_num_prefixes=10, prefix_repetition_output_len=128, speed_bench_dataset_subset='qualitative', speed_bench_output_len=4096, speed_bench_category=None, label=None, backend='vllm', base_url=None, host='127.0.0.1', port=8090, endpoint='/v1/completions', header=None, max_concurrency=8, model='/home/trainee/models/Qwen3-8B', input_len=None, output_len=None, tokenizer=None, tokenizer_mode='auto', use_beam_search=False, logprobs=None, request_rate=inf, burstiness=1.0, disable_tqdm=False, num_warmups=0, profile=False, save_result=False, save_detailed=False, append_result=False, metadata=None, result_dir=None, result_filename=None, ignore_eos=False, percentile_metrics=None, metric_percentiles='99', goodput=None, request_id_prefix='bench-4a34c615-', top_p=None, top_k=None, min_p=None, temperature=None, frequency_penalty=None, presence_penalty=None, repetition_penalty=None, served_model_name=None, lora_modules=None, lora_assignment='random', ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None, ready_check_timeout_sec=0, extra_body=None, skip_tokenizer_init=False, insecure=False, plot_timeline=False, timeline_itl_thresholds='25,50', plot_dataset_stats=False)
WARNING: vllm bench serve no longer sets temperature==0 (greedy) in requests by default. The default will be determined on the server side and can be model/API specific. For the old behavior, include --temperature=0.
Starting initial single prompt test run...
Skipping endpoint ready check.
Starting main benchmark run...
Traffic request rate: inf
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: 8
100%|██████████| 400/400 [04:35<00:00,  1.45it/s]
tip: install termplotlib and gnuplot to plot the metrics
============ Serving Benchmark Result ============
Successful requests:                     400       
Failed requests:                         0         
Maximum request concurrency:             8         
Benchmark duration (s):                  275.82    
Total input tokens:                      27335     
Total generated tokens:                  102400    
Request throughput (req/s):              1.45      
Output token throughput (tok/s):         371.26    
Peak output token throughput (tok/s):    172.00    
Peak concurrent requests:                16.00     
Total token throughput (tok/s):          470.36    
---------------Time to First Token----------------
Mean TTFT (ms):                          217.91    
Median TTFT (ms):                        154.91    
P99 TTFT (ms):                           3116.75   
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          20.62     
Median TPOT (ms):                        20.53     
P99 TPOT (ms):                           24.26     
---------------Inter-token Latency----------------
Mean ITL (ms):                           52.70     
Median ITL (ms):                         47.56     
P99 ITL (ms):                            93.10     
---------------Speculative Decoding---------------
Acceptance rate (%):                     52.25     
Acceptance length:                       2.57      
Drafts:                                  39905     
Draft tokens:                            119715    
Accepted tokens:                         62548     
Per-position acceptance (%):
  Position 0:                            73.53     
  Position 1:                            49.59     
  Position 2:                            33.62     
  Position 3:                            0.00      
  Position 4:                            0.00      
  Position 5:                            0.00      
  Position 6:                            0.00      
  Position 7:                            0.00      
  Position 8:                            0.00      
  Position 9:                            0.00      
  Position 10:                           0.00      
  Position 11:                           0.00      
  Position 12:                           0.00      
  Position 13:                           0.00      
  Position 14:                           0.00      
==================================================
sys:1: DeprecationWarning: builtin type swigvarlink has no __module__ attribute